var txt =[
    {
        'content': '真理惟一可靠的标准就是永远自相符合。',
        'name':'欧文'
     },
    {
        'content':'土地是以它的肥沃和收获而被估价的；才能也是土地，不过它生产的不是粮食，而是真理。如果只能滋生瞑想和幻想的话，即使再大的才能也只是砂地或盐池，那上面连小草也长不出来的。',
        'name':'—— 别林斯基'
     },
    {
        'content':'我需要三件东西：爱情友谊和图书。然而这三者之间何其相通！炽热的爱情可以充实图书的内容，图书又是人们最忠实的朋友。',
        'name':'—— 蒙田'
     },
    {
        'content':'时间是一切财富中最宝贵的财富。',
        'name':'—— 德奥弗拉斯多'},
    {
        'content':'世界上一成不变的东西，只有“任何事物都是在不断变化的”这条真理。',
        'name':'—— 斯里兰卡'},
    {
        'content':'过放荡不羁的生活，容易得像顺水推舟，但是要结识良朋益友，却难如登天。',
        'name':'—— 巴尔扎克'},
    {
        'content':'这世界要是没有爱情，它在我们心中还会有什么意义！这就如一盏没有亮光的走马灯。','name':'—— 歌德'},
    {
        'content':'真正的科学家应当是个幻想家；谁不是幻想家，谁就只能把自己称为实践家。',
        'name':'—— 巴尔扎克'},
    {
        'content':'爱情原如树叶一样，在人忽视里绿了，在忍耐里露出蓓蕾。',
        'name':'—— 何其芳'},
    {
        'content':'一件事实是一条没有性别的真理。',
        'name':'—— 纪伯伦'},
    {
        'content':'友谊是一棵可以庇荫的树。',
        'name':'—— 柯尔律治'},
    {
        'content':'酒杯里竟能蹦出友谊来。',
        'name':'—— 盖伊'},
    {
        'content':'较高级复杂的劳动，是这样一种劳动力的表现，这种劳动力比较普通的劳动力需要较高的教育费用，它的生产需要花费较多的劳动时间。因此，具有较高的价值。 ',
        'name':'—— 马克思'},
    {
        'content':'个人的智慧只是有限的。',
        'name':'—— 普劳图斯'},
    {
        'content':'新的数学方法和概念，常常比解决数学问题本身更重要。 ',
        'name':'—— 华罗庚'},
    {
        'content':'友谊是灵魂的结合，这个结合是可以离异的，这是两个敏感，正直的人之间心照不宣的契约。',
        'name':'—— 伏尔泰'},
    {
        'content':'谁不会休息，谁就不会工作。',
        'name':'—— 列宁'},
    {
        'content':'人生贵知心，定交无暮早。',
        'name':'—— 袁中道'},
    {
        'content':'忠诚可以简练地定义为对不可能的情况的一种不合逻辑的信仰。',
        'name':'—— 门肯'},
    {
        'content':'她们把自己恋爱作为终极目标，有了爱人便什么都不要了，对社会作不了贡献，人生价值最少。',
        'name':'—— 向警予'},
    {
        'content':'说真话不应当是艰难的事情。我所谓真话不是指真理，也不是指正确的话。自己想什麽就讲什麽；自己怎麽想就怎麽说这就是说真话。',
         'name':'—— 巴金'},
    {
        'conten':'谚语可以体现一个民族的创造力，智慧和精神。 ',
        'name':'—— 培根'},
    {
        'content':'从不浪费时间的人，没有工夫抱怨时间不够。 ',
        'name':'—— 杰弗逊'},
    {'content':'成功的秘诀，在永不改变既定的目的。',
    'name':'—— 卢梭'},
    {
        'content':'良好的健康状况和高度的身体训练，是有效的脑力劳动的重要条件。',
        'name':'—— 克鲁普斯卡娅'},
    {'content':'毫无经验的初恋是迷人的，但经得起考验的爱情是无价的。','name':'—— 马尔林斯基'},
    {'content':'笨蛋自以为聪明，聪明人才知道自己是笨蛋。','name':'—— 莎士比亚'},
    {'content':'劳于读书，逸于作文。 ','name':'—— 程端礼'},
    {'content':'温顺的青年人在图书馆里长大，他们相信他们的责任是应当接受西塞罗，洛克，培根发表的意见；他们忘了西塞罗，洛克与培根写这些书的时候，也不过是在图书馆里的青年人。 ','name':'—— 爱默生'},
    {'content':'没有人不爱惜他的生命，但很少人珍视他的时间。','name':'—— 梁实秋'},
    {'content':'爱情只有当它是自由自在时，才会叶茂花繁。认为爱情是某种义务的思想只能置爱情于死地。只消一句话：你应当爱某个人，就足以使你对这个人恨之入骨。 ','name':'—— 罗素'},
    {'content':'科学是到处为家的，不过，在任何不播种的地方，是决不会得到丰收的。 ','name':'—— 赫尔岑'},
    {'content':'不达成功誓不休。','name':'—— 陈潭秋'},
    {'content':'人生并不像火车要通过每个站似的经过每一个生活阶段。人生总是直向前行走，从不留下什么。','name':'—— 刘易斯'},
    {'content':'人生的磨难是很多的，所以我们不可对于每一件轻微的伤害都过于敏感。在生活磨难面前，精神上的坚强和无动于衷是我们抵抗罪恶和人生意外的最好武器。 ','name':'—— 洛克'},
    {'content':'我读的书愈多，就愈亲近世界，愈明了生活的意义，愈觉得生活的重要。 ','name':'—— 高尔基'},
    {'content':'如果你浪费了自己的年龄，那是挺可悲的。因为你的青春只能持续一点儿时间——很短的一点儿时间。','name':'—— 王尔德'},
    {'content':'理想是人生的太阳。','name':'—— 德莱赛'}
];
$(document).ready(function(){
    $(".rndbtn").click(function(){
        var rndnum = Math.floor((Math.random()*38));
      $(".text").text(txt[rndnum]['content']);
      $(".name").text(txt[rndnum]['name']);
    });
    $(".sharebtn").click(function(){
        var quot = "https://twitter.com/intent/tweet?text="+$(".text").html()+$(".name").html();
        $(".twitter-share-button").attr("href",quot);
    });
    $(".weibobtn").click(function(){
        var quot = "http://v.t.sina.com.cn/share/share.php?title="+$(".text").html()+$(".name").html();
        $(".weibo").attr("href",quot);
    });
  });